app/views/home/index.html.erb

    <tbody>
      <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"