app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asd"], ["LIMIT", 1]]
---
  def create
    if @user = User.find_by(email: params[:email]) and @user.authenticate(params[:password])